# BaseExtension Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelColumn..::..BaseExtension Property
AnalyticalModelColumn Class See Also
---
The base extension option.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public StickElementExtension BaseExtension { get; set; }
```

Visual Basic
---
```text
Public Property BaseExtension As StickElementExtension
	Get
	Set
```

Visual C++
---
```text
public:
property StickElementExtension BaseExtension {
	StickElementExtension get ();
	void set (StickElementExtension value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModelColumn Class
Autodesk.Revit.DB.Structure Namespace